Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

#include "stm32h7xx_hal.h"
#include "SSD1680.h"
#include "fonts.h"

#include "interfacev.h"
#include "fc_weights.h"
//#include "model_weights.c"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEBUG_MODE 1

#define INPUT_DIM  9
#define HIDDEN_1   64
#define HIDDEN_2   32
#define OUTPUT_DIM 5
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart7;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_UART4_Init(void);
static void MX_UART5_Init(void);
static void MX_UART7_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void parse_gpgga(uint8_t *line);
void HM10_Process(uint8_t byte);
void Handle_BT_Command(char* cmd);
void Process_WiFi_Data(void);
void debug_disp(void);
int mlp_forward_pass(double current_lat, double current_lon, uint8_t hour_of_day, uint16_t min_of_day, uint8_t day_of_week, int time_to_dept, uint8_t is_ticket_reg, uint8_t is_entering, uint8_t is_exiting);

SPI_HandleTypeDef hspi1;
SSD1680_HandleTypeDef hepd;

static void MX_SSD1680_Init(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint16_t idx = 0;
uint8_t BTBuffer[1];

#define WIFI_BUF_SIZE 512
static uint8_t WFBuffer[WIFI_BUF_SIZE];
static uint16_t wf_idx = 0;

uint8_t GPSBuffer[128];

typedef struct {
    char ssid[32];
    int8_t rssi;
} WiFiInfo;

#define MAX_WIFI_COUNT 5
static WiFiInfo wifi_list[MAX_WIFI_COUNT];
static uint8_t wifi_count = 0;

#define BT_BUF_SIZE 16
static char btrecv[BT_BUF_SIZE];
static uint8_t bt_idx = 0;

char parts[15][16];

int result;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_UART4_Init();
  MX_UART5_Init();
  MX_UART7_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  MX_SSD1680_Init();

  SSD1680_Border(&hepd, ColorWhite);
  SSD1680_Clear(&hepd, ColorWhite);
  SSD1680_Refresh(&hepd, FullRefresh);

  HAL_NVIC_SetPriority(TIM1_UP_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM1_UP_IRQn);
  HAL_TIM_Base_Start_IT(&htim1);

  HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM2_IRQn);
  HAL_TIM_Base_Start_IT(&htim2);

  HAL_NVIC_SetPriority(UART5_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(UART5_IRQn);

  typedef struct
  {
      GPIO_TypeDef* port;
      uint16_t pin;
      GPIO_PinState state;
  }
  GpioSet;

  GpioSet list[] =
  {
      {BT_BLED_GPIO_Port,  BT_BLED_Pin,  GPIO_PIN_SET},
      {BT_RLED_GPIO_Port,  BT_RLED_Pin,  GPIO_PIN_RESET},
      {GPS_RLED_GPIO_Port, GPS_RLED_Pin, GPIO_PIN_RESET},
      {GPS_GLED_GPIO_Port, GPS_GLED_Pin, GPIO_PIN_SET},
      {WF_LED_GPIO_Port,   WF_LED_Pin,   GPIO_PIN_SET},
      {STA_LED_GPIO_Port,  STA_LED_Pin,  GPIO_PIN_SET},
      {EC_LED_GPIO_Port,   EC_LED_Pin,   GPIO_PIN_SET},
      {EC_RELAY_GPIO_Port, EC_RELAY_Pin, GPIO_PIN_RESET},
	  {EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET}
  };

  for (int i = 0; i < sizeof(list)/sizeof(list[0]); i++)
  {
      HAL_GPIO_WritePin(list[i].port, list[i].pin, list[i].state);
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  HAL_UART_Receive_IT(&huart4, BTBuffer, 1);
  HAL_UART_Receive_IT(&huart5, WFBuffer, 1);
  HAL_UART_Receive_IT(&huart7, (uint8_t*)GPSBuffer, 1);

  // Start Define Variable
  uint8_t msg[] = "STM32 is now on\n";
  char *input_train_type, *input_train_kind;

  double debug_array[9] = {24.167680, 120.653612, 17, 1072, 5, 1, 0, 0, 1};
  char *debug_ticket[4] = {"A50111562576561ZZZZ33003230ZZZZZ6ZP7UNxP7UNx15VNA000V7UF0F07", //台中->豐原
	  "N50049351999418ZZZZ10803300ZZZZZ3ZP1VLUP1VNI161NA004y1VHEA49", //桃園->台中
	  "0720412420244007936860000849004202508301834470072025083019154701000000300000030030030000000540006001INTIRS000020250830109ABE", //桃園->台中
	  "0421511450742087503470000333004202505252215520072025052522475201000000100000080020010000000540006000INTETS000020250525101909"  //台中->板橋
  };

  // End Define Variable

  if (!DEBUG_MODE)
  {
	  HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 1000);
	  HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	  SSD1680_Clear(&hepd, ColorWhite);
	  SSD1680_DrawBitmap(&hepd, 0, 0, startupv, 152, 296);
	  SSD1680_Refresh(&hepd, FullRefresh);
	  HAL_Delay(2000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, einvoicev, 152, 296);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, easycardv, 152, 296);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, exhomescreen, 152, 296);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, extra, 152, 296);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, exthsr, 152, 296);
	  HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
  }

  else if (DEBUG_MODE)
  {
	    result = mlp_forward_pass(debug_array[0], debug_array[1], debug_array[2], debug_array[3], debug_array[4], debug_array[5], debug_array[6], debug_array[7],debug_array[8]);

	    for (int i = 0; i < sizeof(debug_ticket); i++)
	    {
	    	if (isalpha((unsigned)debug_ticket[i][0])) input_train_type = "TRA";
	    	else input_train_type = "THSR";


	    	//(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time, char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
	    	epd_ticket_handler(input_train_type);
	    	debug_disp();
	    	HAL_Delay(3000);
	    }
  }

  while (1)
  {
    /* USER CODE END WHILE */

