Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
            if (bt_idx > 0)
            {
                Handle_BT_Command(btrecv);
            }
        }

        // 清空緩衝區
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }
}

void Parse_WiFi_Line(char* line)
{
    // 格式: +CWLAP:(3,"2F_Office_2.4G",-57,"58:11:22:61:d6:80",1,-29,0,4,4,7,1)
    //              ↑   ↑               ↑
    //              加密 SSID            RSSI

    char* ssid_start = strchr(line, '"');
    if (!ssid_start) return;
    ssid_start++; // 跳過第一個 "

    char* ssid_end = strchr(ssid_start, '"');
    if (!ssid_end) return;

    // 提取 SSID
    size_t ssid_len = ssid_end - ssid_start;
    if (ssid_len > 31) ssid_len = 31;

    char ssid[32];
    strncpy(ssid, ssid_start, ssid_len);
    ssid[ssid_len] = '\0';

    // 找到 RSSI (在第一個逗號之後)
    char* rssi_start = strchr(ssid_end, ',');
    if (!rssi_start) return;
    rssi_start++; // 跳過逗號

    int8_t rssi = atoi(rssi_start);

    // 檢查是否已存在
    for (int i = 0; i < wifi_count; i++)
    {
        if (strcmp(wifi_list[i].ssid, ssid) == 0)
        {
            // 更新 RSSI（取較強的）
            if (rssi > wifi_list[i].rssi)
            {
                wifi_list[i].rssi = rssi;
            }
            return;
        }
    }

    // 加入新的 WiFi
    if (wifi_count < MAX_WIFI_COUNT)
    {
        strncpy(wifi_list[wifi_count].ssid, ssid, 31);
        wifi_list[wifi_count].ssid[31] = '\0';
        wifi_list[wifi_count].rssi = rssi;
        wifi_count++;
    }
}

// 顯示 WiFi 列表
void Display_WiFi_List(void)
{
    if (wifi_count == 0)
    {
        #if DEBUG_MODE
            uint8_t msg[] = "No WiFi found\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif
        return;
    }

    #if DEBUG_MODE
        char msg[128];
        int len = snprintf(msg, sizeof(msg), "\r\n=== WiFi Scan (%d networks) ===\r\n", wifi_count);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);

        for (int i = 0; i < wifi_count; i++)
        {
            len = snprintf(msg, sizeof(msg), "%d. %s: %d dBm\r\n",
                          i+1, wifi_list[i].ssid, wifi_list[i].rssi);
            HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
        }

        uint8_t end[] = "============================\r\n\r\n";
        HAL_UART_Transmit(&huart2, end, sizeof(end)-1, 100);
    #endif
}

// 處理 WiFi 數據
void Process_WiFi_Data(void)
{
    // 將緩衝區轉為字串
    WFBuffer[wf_idx] = '\0';

    // 解析每一行
    char* line_start = (char*)WFBuffer;
    char* line_end;

    while ((line_end = strchr(line_start, '\n')) != NULL)
    {
        *line_end = '\0'; // 結束當前行

        // 檢查是否為 CWLAP 回應
        if (strstr(line_start, "+CWLAP:") != NULL)
        {
            #if DEBUG_MODE
                char msg[128];
                int len = snprintf(msg, sizeof(msg), "WiFi: %s\r\n", line_start);
                HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
            #endif

            Parse_WiFi_Line(line_start);
        }
        else if (strstr(line_start, "OK") != NULL)
        {
            // 掃描完成，顯示結果
            Display_WiFi_List();

            // 清空列表準備下次掃描
            wifi_count = 0;
            memset(wifi_list, 0, sizeof(wifi_list));
        }

        line_start = line_end + 1;
    }

    wf_idx = 0;
    memset(WFBuffer, 0, WIFI_BUF_SIZE);
}

void epd_ticket_handler(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time,
						char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
{
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	if (strcmp(train_type, "THSR"))  SSD1680_Text(&hepd, 16, 0, "THSR", &cp866_8x16);
	else if (strcmp(train_type, "TRA"))  SSD1680_Text(&hepd,  16, 0, "TRA", &cp866_8x16);
	SSD1680_Refresh(&hepd, FastFullRefresh);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void debug_disp(void)
{
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Text(&hepd,  0, 0, "Predict:", &cp866_8x16);
	char predict_str[12];
	sprintf(predict_str, "%d", result);
	SSD1680_Text(&hepd,  72, 0, predict_str, &cp866_8x16);
	SSD1680_Refresh(&hepd, FastFullRefresh);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
}

void relu(float *data, int size) {
    for (int i = 0; i < size; i++) {
        if (data[i] < 0.0f) data[i] = 0.0f;
    }
}

void softmax(float *data, int size) {
    float max_val = data[0];
    for (int i = 1; i < size; i++) if (data[i] > max_val) max_val = data[i];
    float sum = 0.0f;
    for (int i = 0; i < size; i++) {
        data[i] = expf(data[i] - max_val);
        sum += data[i];
    }
    for (int i = 0; i < size; i++) data[i] /= sum;
}


int mlp_forward_pass(double current_lat, double current_lon, uint8_t hour_of_day, uint16_t min_of_day, uint8_t day_of_week, int time_to_dept, uint8_t is_ticket_reg, uint8_t is_entering, uint8_t is_exiting)
{
    float x[INPUT_DIM];
    x[0] = current_lat;
    x[1] = current_lon;
    x[2] = (float)hour_of_day;
    x[3] = (float)min_of_day;
    x[4] = (float)day_of_week;
    x[5] = (float)time_to_dept;
    x[6] = (float)is_ticket_reg;
    x[7] = (float)is_entering;
    x[8] = (float)is_exiting;

    float h1[HIDDEN_1];
    float h2[HIDDEN_2];
    float out[OUTPUT_DIM];

    // 2. 第一層前向傳播 (9 -> 64)
    for (int i = 0; i < HIDDEN_1; i++) {
        float sum = fc1_bias[i];
        for (int j = 0; j < INPUT_DIM; j++) {
            sum += x[j] * fc1_weight[i][j];
        }
        h1[i] = sum;
    }
    relu(h1, HIDDEN_1);

    // 3. 第二層前向傳播 (64 -> 32)
    for (int i = 0; i < HIDDEN_2; i++) {
        float sum = fc2_bias[i];
        for (int j = 0; j < HIDDEN_1; j++) {
            sum += h1[j] * fc2_weight[i][j];
        }
        h2[i] = sum;
    }
    relu(h2, HIDDEN_2);

    // 4. 第三層前向傳播 (32 -> 5)
    for (int i = 0; i < OUTPUT_DIM; i++) {
        float sum = fc3_bias[i];
        for (int j = 0; j < HIDDEN_2; j++) {
            sum += h2[j] * fc3_weight[i][j];
        }
        out[i] = sum;
    }

    // 5. 使用 Softmax 轉換為機率並挑選最大值
    softmax(out, OUTPUT_DIM);

    int best_class = 0;
    float max_p = out[0];
    for (int i = 1; i < OUTPUT_DIM; i++) {
        if (out[i] > max_p) {
            max_p = out[i];
            best_class = i;
        }
    }

    return best_class; // 回傳預測類別 (0~4)
}

/* USER CODE END 4 */

